src_doc/InformationRegisters/ОчередьОбновленияАдреснойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбновленияАдреснойКниги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыОбновления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникДанныхАдреснойКниги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОбновленияАдреснойКниги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РодительОбъекта</Name>
					<Comment>Реквизит предназначен для вычисления доступа к записи</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникДанныхАдреснойКниги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдреснаяКнига</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектДоступаАдреснойКниги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ОчередьОбновленияАдреснойКниги/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Запись.Объект);
	Отбор.Вставить("Операция", Запись.Операция);
	Отбор.Вставить("РодительОбъекта", Запись.РодительОбъекта);
	Отбор.Вставить("Раздел", Запись.Раздел);
	Отбор.Вставить("ОбъектДоступа", Запись.ОбъектДоступа);
	
	ДанныеЗаписи = РегистрыСведений.ОчередьОбновленияАдреснойКниги.Получить(Отбор);
	ПараметрыОбновления = ДанныеЗаписи.ПараметрыОбновления.Получить();
	Если ТипЗнч(ПараметрыОбновления) = Тип("Структура") Тогда
		ПредставлениеПараметровОбновления = ПредставлениеСтруктурыПараметровОбновления(ПараметрыОбновления);
	ИначеЕсли ТипЗнч(ПараметрыОбновления) = Тип("Массив") Тогда
		Для Каждого Элемент Из ПараметрыОбновления Цикл
			ПредставлениеПараметровОбновления =
				ПредставлениеПараметровОбновления + ?(ПредставлениеПараметровОбновления = "", "", Символы.ПС);
			Если ТипЗнч(Элемент) = Тип("Структура") Тогда
				ПредставлениеПараметровОбновления =
					ПредставлениеПараметровОбновления + ПредставлениеСтруктурыПараметровОбновления(Элемент);
			Иначе
				ПредставлениеПараметровОбновления = ПредставлениеПараметровОбновления + Строка(Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПредставлениеСтруктурыПараметровОбновления(ПараметрыОбновления)
	
	ПредставлениеПараметровОбновления = "";
	
	Для Каждого КлючИЗначение1 Из ПараметрыОбновления Цикл
		ПредставлениеПараметровОбновления =
			ПредставлениеПараметровОбновления + ?(ПредставлениеПараметровОбновления = "", "", Символы.ПС);
		
		Если ТипЗнч(КлючИЗначение1.Значение) = Тип("Структура") Тогда
			ПредставлениеПараметровОбновления =
				ПредставлениеПараметровОбновления + СтрШаблон("%1:", КлючИЗначение1.Ключ);
			Для Каждого КлючИЗначение2 Из КлючИЗначение1.Значение Цикл
				ПредставлениеПараметровОбновления = ПредставлениеПараметровОбновления + Символы.ПС;
				ПредставлениеПараметровОбновления = ПредставлениеПараметровОбновления + 
					СтрШаблон("    %1: %2",
						КлючИЗначение2.Ключ,
						?(ТипЗнч(КлючИЗначение2.Значение) = Тип("Массив"),
							СтрСоединить(КлючИЗначение2.Значение, Символы.ПС + Символы.Таб + Символы.Таб),
							КлючИЗначение2.Значение));
			КонецЦикла;
		Иначе
			ПредставлениеПараметровОбновления = ПредставлениеПараметровОбновления +
				СтрШаблон("%1: %2",
					КлючИЗначение1.Ключ,
					?(ТипЗнч(КлючИЗначение1.Значение) = Тип("Массив"),
							СтрСоединить(КлючИЗначение1.Значение, Символы.ПС + Символы.Таб),
							КлючИЗначение1.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПредставлениеПараметровОбновления;
	
КонецФункции

#КонецОбласти
